---
kind: method
id: M:Autodesk.Revit.UI.TaskDialog.#ctor(System.String)
zh: 提示、弹窗、消息框
source: html/5aaa0247-7707-7508-4973-009b01669297.htm
---
# Autodesk.Revit.UI.TaskDialog.#ctor Method

**中文**: 提示、弹窗、消息框

Creates a task dialog with title.

## Syntax (C#)
```csharp
public TaskDialog(
	string title
)
```

## Parameters
- **title** (`System.String`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when title is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when title is an empty string.